awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/CMSIS/SVD/PY32F005xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DBGMCU</name>
      <description>Debug support</description>
      <baseAddress>0x40015800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IDCODE</name>
          <description>MCU Device ID Code Register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>REV_ID</name>
              <description>REV_ID</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>Debug MCU Configuration Register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>DBG_SLEEP</name>
              <description>Debug SLEEP Mode</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DBG_STOP</name>
              <description>Debug Stop Mode</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_FZ1</name>
          <description>APB Freeze Register1</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DBG_IWDG_STOP</name>
              <description>Debug IWDG stopped when Core ishalted</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DBG_LPTIM_STOP</name>
              <description>Debug LPTIM stopped when Core ishalted</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_FZ2</name>
          <description>APB Freeze Register2</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DBG_TIMER1_STOP</name>
              <description>Debug Timer 1 stopped when Core ishalted</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DBG_TIM13_STOP</name>
              <description>Debug TIM 13 stopped whenCore is halted</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>DBG_TIM14_STOP</name>
              <description>Debug TIM 14 stopped whenCore is halted</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>DBG_PWM1_STOP</name>
              <description>Debug PWM1 stopped whenCore is halted</description>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EXTI</name>
      <description>External interrupt/event controller</description>
      <baseAddress>0x40021800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>EXTI0_1</name>
        <description>EXTI Line 0 and 1 Interrupt</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>EXTI2_3</name>
        <description>EXTI Line 2 and 3 Interrupt</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>EXTI4_15</name>
        <description>EXTI Line 4 to 15 Interrupt</description>
        <value>7</value>
      </interrupt>
      <registers>
        <register>
          <name>RTSR</name>
          <description>EXTI rising trigger selection register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>RT0</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RT1</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RT2</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RT3</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RT4</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RT5</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RT6</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RT7</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RT17</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RT18</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FTSR</name>
          <description>EXTI falling trigger selection register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FT0</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FT1</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FT2</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>FT3</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>FT4</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>FT5</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>FT6</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>FT7</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FT17</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>FT18</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SWIER</name>
          <description>EXTI software interrupt event register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>SWI0</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SWI1</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SWI2</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SWI3</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SWI4</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SWI5</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SWI6</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SWI7</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SWI17</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SWI18</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <description>EXTI pending register</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>PR0</name>
              <description>configurable event inputs x rising edge Pending bit.</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PR1</name>
              <description>configurable event inputs x rising edge Pending bit.</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PR2</name>
              <description>configurable event inputs x rising edge Pending bit.</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PR3</name>
              <description>configurable event inputs x rising edge Pending bit.</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PR4</name>
              <description>configurable event inputs x rising edge Pending bit.</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PR5</name>
              <description>configurable event inputs x rising edge Pending bit.</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PR6</name>
              <description>configurable event inputs x rising edge Pending bit.</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PR7</name>
              <description>configurable event inputs x rising edge Pending bit.</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PR17</name>
              <description>configurable event inputs x rising edge Pending bit.</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>PR18</name>
              <description>configurable event inputs x rising edge Pending bit.</description>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR1</name>
          <description>EXTI external interrupt selection register</description>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>EXTI0</name>
              <description>GPIO port selection</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>EXTI1</name>
              <description>GPIO port selection</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>EXTI2</name>
              <description>GPIO port selection</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>EXTI3</name>
              <description>GPIO port selection</description>
              <bitRange>[25:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR2</name>
          <description>EXTI external interrupt selection register</description>
          <addressOffset>0x64</addressOffset>
          <fields>
            <field>
              <name>EXTI4</name>
              <description>GPIO port selection</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>EXTI5</name>
              <description>GPIO port selection</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>EXTI6</name>
              <description>GPIO port selection</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>EXTI7</name>
              <description>GPIO port selection</description>
              <bitRange>[25:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>EXTI CPU wakeup with interrupt mask register</description>
          <addressOffset>0x80</addressOffset>
          <fields>
            <field>
              <name>IM0</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IM1</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IM2</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>IM3</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IM4</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IM5</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IM6</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IM7</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IM17</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>IM18</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>IM29</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMR</name>
          <description>EXTI CPU wakeup with event mask register</description>
          <addressOffset>0x84</addressOffset>
          <fields>
            <field>
              <name>EM0</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EM1</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EM2</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EM3</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EM4</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EM5</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EM6</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EM7</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EM17</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EM18</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EM29</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
