awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/CMSIS/SVD/PY32F005xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI1</name>
      <description>Serial peripheral interface</description>
      <groupName>SPI</groupName>
      <baseAddress>0x40013000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SPI1</name>
        <description>SPI1 global Interrupt</description>
        <value>25</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <description>desc CR1</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>CPHA</name>
              <description>desc CPHA</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <description>desc CPOL</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MSTR</name>
              <description>desc MSTR</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BR</name>
              <description>desc BR</description>
              <bitRange>[5:3]</bitRange>
            </field>
            <field>
              <name>SPE</name>
              <description>desc SPE</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LSBFIRST</name>
              <description>desc LSBFIRST</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SSI</name>
              <description>desc SSI</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SSM</name>
              <description>desc SSM</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RXONLY</name>
              <description>desc RXONLY</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DDF</name>
              <description>desc DDF</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BIDIOE</name>
              <description>desc BIDIOE</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>BIDIMODE</name>
              <description>desc BIDIMODE</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>desc CR2</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>SSOE</name>
              <description>desc SSOE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ERRIE</name>
              <description>desc ERRIE</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RXNEIE</name>
              <description>desc RXNEIE</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEIE</name>
              <description>desc TXEIE</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>desc SR</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>RXNE</name>
              <description>desc RXNE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXE</name>
              <description>desc TXE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MODF</name>
              <description>desc MODF</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OVR</name>
              <description>desc OVR</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BSY</name>
              <description>desc BSY</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FRLVL</name>
              <description>desc FRLVL</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FTLVL</name>
              <description>desc FTLVL</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>desc DR</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DR</name>
              <description>desc DR</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <description>System configuration controller</description>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFGR1</name>
          <description>SYSCFG configuration register 1</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>MEM_MODE</name>
              <description>Memory mapping selection bits</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_FLTEN</name>
              <description>desc I2C_PB6_FMP</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <description>SYSCFG configuration register 2</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>LOCKUP_LOCK</name>
              <description>Cortex-M0+ LOCKUP bit enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PVD_LOCK</name>
              <description>TIM1 ETR source selection</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_ENS</name>
          <description>desc GPIO_ENS</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>PA_ENS</name>
              <description>desc PA_ENS</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>PB_ENS</name>
              <description>desc PB_ENS</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>PC_ENS</name>
              <description>desc PC_ENS</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>PD_ENS</name>
              <description>desc PC_ENS</description>
              <bitRange>[25:24]</bitRange>
            </field>
          </fields>
        </register>
